In [1]:
# import module
import pandas as pd

# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

# display dataframe
display(dataFrame)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [ ]:
# filter dataframe


display(dataFrame.loc[(dataFrame['Salary']>=100000)& (dataFrame['Age']<40)& (dataFrame['JOB'].str.startswith('D')),['Name','JOB']])

        Name       JOB
0   RACHEL    DESIGNER

In [8]:
# Filter Pandas Dataframe using NumPy


import pandas as pd
import numpy as np




# Filter dataframe


filtered_values=np.where((dataFrame['Salary']>=100000)&(dataFrame['Age']<40)& 
(dataFrame['JOB'].str.startswith('D')))
print(filtered_values)
display(dataFrame.loc[filtered_values])

(array([0]),)

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

In [10]:
# Filter Pandas Dataframe Using Query (eval and query works only with columns)



display(dataFrame.query('Salary<=100000 & Age<40& JOB.str.startswith("C").values'))

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

In [12]:
# Pandas Boolean indexing mu;tiple conditions standard way ('Boolean indexing' works with values in a column only)

display(dataFrame[(dataFrame['Salary']>=100000)&(dataFrame['Age']<40)&
dataFrame['JOB'].str.startswith('P')][['Name', 'Age','Salary']])

         Name  Age  Salary
3    ROSS       33  120000

In [13]:
# Eval multiple conditions ('eval' and 'query' works only with columns)

# filterdataframe


display(dataFrame[dataFrame.eval('Salary<=100000 & (Age<40)&JOB.str.startswith("A").values')])

        Name  Age  Salary     JOB
5   JOEY       30   95000  ARTIST